---
kind: method
id: M:Autodesk.Revit.DB.FamilyThermalProperties.#ctor
source: html/e8d4c84c-a6f3-197c-080c-25698e042f7b.htm
---
# Autodesk.Revit.DB.FamilyThermalProperties.#ctor Method

Constructs a new FamilyThermalProperties with default settings.

## Syntax (C#)
```csharp
public FamilyThermalProperties()
```